In [114]:
import pandas as pd
import numpy as np

# dropna()
axis 0 for entire row.

axis 1 for entire column.

inplace = True ,perameter use to modify the actual data.

use np.nan for the adding nan or missing value in data.

In [115]:
a = {"heigh-way speed":["1kmph","7kmph","8kmph","9kmph","29kmph","45kmog"] , "fule_leter":[1,np.nan,8,9,np.nan,45]}
n = pd.DataFrame(a)
print("Before removing nan\n",n)
# doesn't modify original
print("\n\nafter removing nan")

# change the actual data(inplace=True )
print()
n.dropna(subset=["fule_leter"],axis=0,inplace=True)
n

Before removing nan
   heigh-way speed  fule_leter
0           1kmph         1.0
1           7kmph         NaN
2           8kmph         8.0
3           9kmph         9.0
4          29kmph         NaN
5          45kmog        45.0


after removing nan

  heigh-way speed  fule_leter
0           1kmph         1.0
2           8kmph         8.0
3           9kmph         9.0
5          45kmog        45.0

# replace()

In [116]:
a = {"make":["audi","audi","audi","audi","audi","audi"] , "normalized_loses":[164,np.nan,152,162,np.nan,147]}
df = pd.DataFrame(a)
mean1 = df["normalized_loses"].mean()
print(df)
print("\n"*2)
# df["normalized_loses"].replace(np.nan , mean1, inplace=True)
df["normalized_loses"] = df["normalized_loses"].replace(np.nan, mean1)
df

   make  normalized_loses
0  audi             164.0
1  audi               NaN
2  audi             152.0
3  audi             162.0
4  audi               NaN
5  audi             147.0

   make  normalized_loses
0  audi            164.00
1  audi            156.25
2  audi            152.00
3  audi            162.00
4  audi            156.25
5  audi            147.00

# rename and change values in column

In [117]:
a = {"mph":[21,24,32,52,45,23]}
mph_to_leter = pd.DataFrame(a)
print(mph_to_leter,"\n"*2)

mph_to_leter["mph"] = 235 / mph_to_leter["mph"]

mph_to_leter.rename(columns = {"mph":"city-l/100km"},inplace=True)
mph_to_leter

   mph
0   21
1   24
2   32
3   52
4   45
5   23

   city-l/100km
0     11.190476
1      9.791667
2      7.343750
3      4.519231
4      5.222222
5     10.217391

# change the datatype of whole column

In [118]:
print(mph_to_leter["city-l/100km"])
mph_to_leter["city-l/100km"] = mph_to_leter["city-l/100km"].astype("int64")
print("\n"*3,mph_to_leter["city-l/100km"])

0    11.190476
1     9.791667
2     7.343750
3     4.519231
4     5.222222
5    10.217391
Name: city-l/100km, dtype: float64



 0    11
1     9
2     7
3     4
4     5
5    10
Name: city-l/100km, dtype: int64

In [119]:
a = 4544.654545
print(round(a))

4545

# Binning in Python

### divide all column to different price section
The NumPy.linspace() function returns an array of evenly spaced values within the specified interval [start, stop].

Pandas cut() function is used to separate the array elements into different bins . 
The cut function is mainly used to perform statistical analysis on scalar data.

In [120]:
import random
a = {'price': [50999,9379,67520,41023,
               23403,94860,23251,19022,50824,85683,47859,36317,
               6264,16918,18682,87742,23919,74709,88666,25172,40174,
               39100,1107,97050,92192,97313,88986,64929,50250,28414,18963,23648]}
binning = pd.DataFrame(a)

print(binning.tail(8),"\n"*3)

divide_into_four_part = np.linspace(min(binning["price"]),max(binning["price"]),4)
grup_name = ['low', 'medium', 'high']
binning['price_lable'] = pd.cut(binning['price'], divide_into_four_part , labels = grup_name,include_lowest = True)
binning.tail(8)

    price
24  92192
25  97313
26  88986
27  64929
28  50250
29  28414
30  18963
31  23648

    price price_lable
24  92192        high
25  97313        high
26  88986        high
27  64929      medium
28  50250      medium
29  28414         low
30  18963         low
31  23648         low

In [121]:
pwd()

'C:\\Users\\suraj\\jupyter notebook'